In [22]:
import pandas as pd
import numpy as np

In [23]:
import matplotlib.pyplot as plt

In [24]:
file = 'states.csv'

In [25]:
data = pd.read_csv(file)

In [26]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4218 entries, 0 to 4217
Data columns (total 8 columns):
state                 4218 non-null object
indicator_id          4218 non-null object
indicator             4181 non-null object
indicator_category    4181 non-null object
urban                 4084 non-null object
rural                 4103 non-null object
total                 4218 non-null object
total_2005-06         3305 non-null object
dtypes: object(8)
memory usage: 263.7+ KB

In [27]:
data = data.dropna(axis=0, how='any', subset=['urban', 'indicator_category', 'indicator_id', 'rural', 'total'])

In [28]:
data.head()

,state,indicator_id,indicator,indicator_category,urban,rural,total,total_2005-06
0,Andaman and Nicobar Islands,1,Population (female) age 6 years and above who ...,Population and Household Profile,87.6,82.6,84.7,NaN
1,Andaman and Nicobar Islands,2,Population below age 15 years (%),Population and Household Profile,23.4,24.3,23.9,NaN
2,Andaman and Nicobar Islands,3,Sex ratio of the total population (females per...,Population and Household Profile,966,984,977,NaN
3,Andaman and Nicobar Islands,4,Sex ratio at birth for children born in the la...,Population and Household Profile,708,978,859,NaN
4,Andaman and Nicobar Islands,5,Children under age 5 years whose birth was reg...,Population and Household Profile,97.2,98.4,97.9,NaN

In [29]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4048 entries, 0 to 4217
Data columns (total 8 columns):
state                 4048 non-null object
indicator_id          4048 non-null object
indicator             4048 non-null object
indicator_category    4048 non-null object
urban                 4048 non-null object
rural                 4048 non-null object
total                 4048 non-null object
total_2005-06         3273 non-null object
dtypes: object(8)
memory usage: 284.6+ KB

In [30]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4048 entries, 0 to 4217
Data columns (total 8 columns):
state                 4048 non-null object
indicator_id          4048 non-null object
indicator             4048 non-null object
indicator_category    4048 non-null object
urban                 4048 non-null object
rural                 4048 non-null object
total                 4048 non-null object
total_2005-06         3273 non-null object
dtypes: object(8)
memory usage: 284.6+ KB
None

In [31]:
data = data[data['indicator_id'] == '105']

In [32]:
data['urban'] = pd.to_numeric(data['urban'], errors='coerce')
data['rural'] = pd.to_numeric(data['rural'], errors='coerce')
data['total'] = pd.to_numeric(data['total'], errors='coerce')

data['indicator_id'] = pd.to_numeric(data['indicator_id'], errors='coerce')

In [33]:
data.head()

,state,indicator_id,indicator,indicator_category,urban,rural,total,total_2005-06
103,Andaman and Nicobar Islands,105,Women owning a house and/or land (alone or joi...,Women's Empowerment and Gender Based Violence ...,26.6,32.1,29.7,NaN
218,Andhra Pradesh,105,Women owning a house and/or land (alone or joi...,Women's Empowerment and Gender Based Violence ...,42.8,45.6,44.7,NaN
331,Arunachal Pradesh,105,Women owning a house and/or land (alone or joi...,Women's Empowerment and Gender Based Violence ...,61.8,59.0,59.7,na
445,Assam,105,Women owning a house and/or land (alone or joi...,Women's Empowerment and Gender Based Violence ...,45.9,53.7,52.3,na
559,Bihar,105,Women owning a house and/or land (alone or joi...,Women's Empowerment and Gender Based Violence ...,46.8,60.9,58.8,na

In [34]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 36 entries, 103 to 4208
Data columns (total 8 columns):
state                 36 non-null object
indicator_id          36 non-null int64
indicator             36 non-null object
indicator_category    36 non-null object
urban                 36 non-null float64
rural                 35 non-null float64
total                 36 non-null float64
total_2005-06         29 non-null object
dtypes: float64(3), int64(1), object(4)
memory usage: 2.5+ KB

In [35]:
data = data.drop('indicator_id', axis=1)

In [36]:
data = data.drop('indicator_category', axis=1)

In [37]:
data.head()

,state,indicator,urban,rural,total,total_2005-06
103,Andaman and Nicobar Islands,Women owning a house and/or land (alone or joi...,26.6,32.1,29.7,NaN
218,Andhra Pradesh,Women owning a house and/or land (alone or joi...,42.8,45.6,44.7,NaN
331,Arunachal Pradesh,Women owning a house and/or land (alone or joi...,61.8,59.0,59.7,na
445,Assam,Women owning a house and/or land (alone or joi...,45.9,53.7,52.3,na
559,Bihar,Women owning a house and/or land (alone or joi...,46.8,60.9,58.8,na

In [38]:
data = data.drop('total_2005-06', axis=1)

In [39]:
data.head()

,state,indicator,urban,rural,total
103,Andaman and Nicobar Islands,Women owning a house and/or land (alone or joi...,26.6,32.1,29.7
218,Andhra Pradesh,Women owning a house and/or land (alone or joi...,42.8,45.6,44.7
331,Arunachal Pradesh,Women owning a house and/or land (alone or joi...,61.8,59.0,59.7
445,Assam,Women owning a house and/or land (alone or joi...,45.9,53.7,52.3
559,Bihar,Women owning a house and/or land (alone or joi...,46.8,60.9,58.8

In [40]:
data = data.drop('indicator', axis=1)

In [41]:
data.head()

                           state  urban  rural  total
103  Andaman and Nicobar Islands   26.6   32.1   29.7
218               Andhra Pradesh   42.8   45.6   44.7
331            Arunachal Pradesh   61.8   59.0   59.7
445                        Assam   45.9   53.7   52.3
559                        Bihar   46.8   60.9   58.8

In [42]:
from collections import OrderedDict
result_color = OrderedDict([("urban","red"),("rural", "green"),("total","black"),])
data.to_csv('ownahouse.csv', index=False)